[
  {
    "path": "posts/2021-06-19-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "In this post, I share how I used Tableau to redesign a graphic to improve its clarity and aesthetics. I introduce interactivity through the use of filters, tooltips, and animation.",
    "author": [
      {
        "name": "Kevin Sunga",
        "url": {}
      }
    ],
    "date": "2021-06-19",
    "categories": [],
    "contents": "\r\n\r\n  c{\r\n    font-family: 'Courier New', monospace;\r\n  }\r\n  \r\n  body{\r\n    font-size: small;\r\n  }\r\nOriginal Graphic1.0 Clarity\r\nNo.\r\nCritique\r\nAlternative Design\r\nC1\r\nIt’s not clear what the axes are measuring. Is it the total value of net imports and net exports? Moreover, the scale isn’t explicit. Based on some context clues, my guess is it’s billions, but the graph would be better if it was explicit.\r\nRelabel the x- and y-axes as “Import Value (S$)” and “Export Value (S$)” respectively and add “B” to the axes values to signify the scale of the graph is billions.\r\nC2\r\nThe center of the circle is used to indicate whether a trading partner is a net importer or a net exporter.\r\nUse a color scale to indicate whether a trading partner is a net importer or a net exporter. This method is better for several reasons: 1) it is easier and faster to tell the trading partner’s status and 2) it also conveys a degree or magnitude of net importer or net exporter as opposed to just a binary.\r\nC3\r\nThe year and duration are not mentioned anywhere.\r\nFirst, add the year and time period to the title of each graph. Second, add a filter to enable the ability to see trade by custom time dimensions.\r\nC4\r\nThe trading partners that are included are not mentioned anywhere. Why are some trading partners included and others are not?\r\nAdd an explanation: Singapore’s Top 10 Trading Partners from 1976-2020 are included.\r\nC5\r\nThe “information” text introduces time components which suggests that the graph should convey some element of time or duration. For example, “Since 2009, the value of exports exceeds imports for merchandise trade with Mainland China.” Unfortunately, bubble graphs, at least the way it’s currently visualized, are not suited for visualizing data over time.\r\nThis critique is addressed in three ways. First, I add a date filter using date ranges to enable the user to choose the time period to analyze. Second, the bubble graph can be animated and trails can be added. The trails can be analyzed to understand the time component while maintaining the same original visual. This can be further supplemented by surfacing more detailed information in the tooltip. Third, the bubble graph can be supplemented by a time series line graph. To make the two graphs work more seamlessly together in a dashboard view, it would also be recommended to add an action that synchronizes the highlighting and interactivity of both graphs.\r\nC6\r\nThe graph claims that Taiwan is the top net exporter and Hong Kong is the top net importer. Beyond this, we aren’t able to understand how other countries rank. For example, who are the 2nd or 3rd importers and exporters?\r\nUse the tooltip to surface more detailed information when a user hovers over a trading partner. For example, a trading partner’s relative rank in terms of imports and exports.\r\nC7\r\nIt’s not possible to intuit from the graph whether Singapore as a country overall is a net importer or net exporter.\r\nTo be able to address this, a simple bar chart comparing imports and exports for Singapore inclusive of all the trading partners can be added to the dashboard view. This bar chart should be dynamic and change with the date and market filters on the dashboard.\r\n2.0 Aesthetics\r\nNo.\r\nCritique\r\nAlternative Design\r\nA1\r\nThe use of solid colors makes it such that when the circles overlap with each other, they obscure the centers which are important in determining whether a market is a net importer or exporter.\r\nThe circles can be made opaque. Furthermore, the use of a color scale to denote net import and net export renders the center point irrelevant and thus it can be removed.\r\nA2\r\nThe graph uses 12+ colors which research has shown is more colors than humans can effectively use. In Fundamentals of Data Visualization, Claus O. Wilke writes “Once we reach eight to ten different categories or more, the task of matching colors to categories becomes too burdensome to be useful, even if the colors remain sufficiently different to be distinguishable in principle.” Moreover, Wilke argues that color should serve a purpose, and in the graphic, color doesn’t serve a purpose other than to differentiate between trading partners which can be more effectively achieved by a label.\r\nUse color to denote net importer and net exporter status on a scale in both the “Motion” and “Time Series” graphs. This helps to visually indicate a trading partner’s status. For the “Motion” graph, the color scale also helps to differentiate between the trading partners even though this isn’t the primary objective of the use of color. For the “Time Series” graph, the use of the color scale enables the reader to easily and quickly understand net balance trends overtime (e.g. changing from net import to net exporter). Instead of using color to differentiate between trading partners, labels should be used as recommended by Wilke. For the “Time Series” graph in particular, the labels have a high likelihood of overlapping with each other. To address this, add highlighting to surface the trading partner of interest and visually deprioritize others.\r\nA3\r\nApart from the diagonal divide for imports and exports, the background of the graph has no visual aids to facilitate the reading and interpreting of the graph. This makes it difficult get more precise readings of the x- and y-axes.\r\nThe diagonal divide for imports and exports is useful, but it needn’t be accomplished by highlighting areas. Instead, add a diagonal reference line that’s more subtle but still visually divides the graph between net import and net export.\r\n3.0 Proposed Visualization\r\nMock RedesignTo see the redesigned visual in Tableau Public, click here.\r\n4.0 Step-by-Step guide\r\nNo.\r\nInstructions\r\nImage\r\nS1\r\nOpen a new Tableau notebook. On the left-hand panel, import the file “outputFile.xlsx”. Once imported, drag the import table into the main pane. Next, drag the export table into the main pain to create a relationship between the two tables.\r\n\r\nS2\r\nNext, we’ll want to pivot the date columns in both the import and export tables. Starting with the import table, select the first date column (it should be 1976 Jan). Scroll all the way to the right and hold SHIFT and click the last date column (it should be 2021 Apr). Once all the date columns are highlighted, click on the black down arrow above any of the columns and click “Pivot”. Repeat for the export table.\r\n\r\nS3\r\nAfter pivoting the import and export tables, we need to do some further data processing. Starting with the Pivot Field Names column in the import table, click on the “Abc” in the top left corner of the column and select “Date”. Rename the column to “Import Date”. Next, change the Pivot Field Values column to “Number (decimal)” and rename it “Import Value Raw”. Repeat for the export table.\r\n\r\nS4\r\nWe want to clean up the Variables column to get the market name isolated. To do this, click on the black down arrow in the Variables column and click “Split”. This will create two new columns. Rename Variables – Split 1 as “Import Market”. Rename Variables – Split 2 as “Import Scale”. Repeat for the export table.\r\n\r\nS5\r\nNext, we want to create a new calculated field that normalizes the Value Raw columns. Click on the black down arrow in the Import Value Raw column and click “Create Calculated Field…”. Name this new field “Import Value” and input the following formula: CASE [Import Scale] WHEN ‘Million’ THEN [Import Value Raw] * 1000000 ELSE [Import Value Raw] * 1000 END  Repeat for the export table.\r\n\r\nS7\r\nTo finish the data prep phase, let’s add some filters to the Data Source. On the top right-hand corner, click “Add” > “Add…” > “Import Market”. Filter for Malaysia, United States, Mainland China, Japan, European Union, Hong Kong, Indonesia, Taiwan, Republic of Korea, and Thailand which are Singapore’s top 10 trading partners overall.\r\n\r\nS8\r\nCreate a new worksheet and name it “Motion”. Drag “Import Value” to Columns, “Export Value” to Rows, and “Import Market” to the Detail shelf. The resulting graph should look something like what you see on the right.\r\n\r\nS9\r\nNext, we’re going to create some new fields to help us add more dimension to the graph. On the left pane, click on the black down arrow at the top right-hand corner and click “Create Calculated Field.” Name this field “Total Trade Value” and input the formula: [Import Value] + [Export Value]. Create another calculated field. Name it “Net Balance” and input the formula: [Export Value] - [Import Value].\r\n\r\nS10\r\nDrag “Total Trade Value” to the Size shelf. Drag “Net Balance” to the Color shelf. Drag “Import Market” to the Label shelf.\r\n\r\nS11\r\nLet’s make some aesthetic modifications. These changes are optional but recommended. Click on the Shape shelf and change the shape to a solid circle. Click on the Size shelf and increase the size. Click on the Color shelf and change opacity to 50-60%. Click on “Edit Colors…” and click on the checkbox “Use Full Color Range”.\r\n\r\nS12\r\nNow, let’s add some filters. Drag “Import Market” to the Filters shelf. The default settings are ok. Drag “Import Date” to the Filters shelf. For dates, choose the “Range of Dates” option and click “Next” > “OK”. Show both filters by right-clicking and clicking “Show Filter”.\r\n\r\nS13\r\nNow, time to add some animation! Drag “Import Date” to the Pages shelf. In the Pages filter, click on the checkbox “Show history”. For the options, choose “Selected”, “All”, and “Trails”. You can click on the right or left arrows in the Pages filter to animate the graph!\r\n\r\nS14\r\nTo make the animations smoother, go to “Format” > “Animations…”. Change Workbook Default “On” and change Duration to “0.50 seconds (Medium)”.\r\n\r\nS15\r\nNow, we’re going to add a diagonal reference line to visually separate “net importers” and “net exporters”. First, create a calculated field named “Reference Line” and input “Import Value”.\r\n\r\nS16\r\nDrag “Reference Line” to Rows. Right-click on the “Reference Line” axis and click “Dual Axis”.\r\n\r\nS17\r\nRight-click on the “Reference Line” axis again and click “Synchronize Axis”.\r\n\r\nS18\r\nRight-click on one of the grey circles and click “Trend Lines” > “Show Trend Lines”.\r\n\r\nS19\r\nRight-click on the trend line and click “Format…”. Choose the wider dashes and change the color to dark red.\r\n\r\nS20\r\nLet’s clean up the graph a bit. First, remove all the fields from the “Reference Line” Marks shelf except for the “Import Market” Detail. Second, again for the “Reference Line” Marks shelf, click on the Size shelf and decrease the size to the lowest. Third, again for the “Reference Line” Marks shelf, click on the Color shelf and change opacity to 0%. Lastly, right-click on the “Reference Line” axis and uncheck “Show Header”.\r\n\r\nS21\r\nNow, we’ll work on adding some details in the tooltip. First, create a new worksheet and name it “Bar (Tooltip)”. Drag “Import Value” and “Export Value” to both Columns and Rows. Next, click on “Show Me” on the top right-hand corner and click on the horizontal bar graph.\r\n\r\nS22\r\nFormat the graph by making it smaller. Aim roughly for 300x200. Format the axis as well. Change the Scale to “Numbers (Custom)” and Display Units to “Billions (B)”. Add “(S$)” to the axis label to clarify the measurement. The resulting graph should look something like the graph to the right. Save this graph for now, and we’ll add it to the tooltip later.\r\n\r\nS23\r\nBack to the “Motion” worksheet. We’re going to create four new calculated fields: Name: “Rank by Total Trade Value” Formula: RANK_DENSE(SUM([Total Trade Value]), ‘desc’) Name: “Rank by Import Value” Formula: RANK_DENSE(SUM([Import Value]), ‘desc’) Name: “Rank by Export Value” Formula: RANK_DENSE(SUM([Export Value]), ‘desc’) Name: “Relationship” Formula: IF [Net Balance] < 0 THEN ‘net importer’ ELSE ‘net exporter’ END\r\n\r\nS24\r\nTo enable the use of these new calculated fields in the tooltip, drag the “Rank by Total Trade Value”, “Rank by Import”, “Rank by Export”, and “Relationship” fields into the Tooltip shelf for Export Value.\r\n\r\nS25\r\nRight-click on the “Rank” fields in the Marks shelf and click on “Compute Using” > “Import Market”.\r\n\r\nS26\r\nClick on the Tooltip shelf and input the following text: In <YEAR(Import Date)>,  was ranked* <AGG(Rank by Total Trade Value)> in terms of total merchandise trade value which equaled <SUM(Total Trade Value)>. Singapore was a <ATTR(Relationship)> with a net balance (export - import) of <SUM(Net Balance)>. The breakdown into imports and exports are <SUM(Import Value)> and <SUM(Export Value)> respectively. In terms of relative size, imports rank* <AGG(Rank by Import Value)> while the exports rank* <AGG(Rank by Export Value)>. * Compared to other markets included in the analysis.\r\n\r\nS27\r\nRemember “Bar (Tooltip)”? Let’s insert that graph into the tooltip. Click on the “Insert” dropdown > “Sheets” > “Bar (Tooltip)”. Click “OK”.\r\n\r\nS28\r\nClick on the black down arrow for “SUM(Import Value)” in the Tooltip shelf and click “Format”. Make sure you’re on the “Pane” tab. Change the Numbers setting to “Currency (Custom)”, 0 Decimal Places, “Billions (B)” Display Units, and S$ Prefix. Repeat this for Export Value, Total Trade Value, and Net Balance.\r\n\r\nS29\r\nAdd a title “Animated Bubble Graph of Singapore Merchandise Import and Export Value by Trading Parnter, ”.\r\n\r\nS30\r\nWe’re done with the “Motion” worksheet for now. Create a new worksheet and call it “Time Series”. Drag “Import Date” to Columns. Drag “Total Trade Value” to Rows.\r\n\r\nS31\r\nDrag “Import Market” to the Label and Detail shelves. Drag “Net Balance” to the Color shelf.\r\n\r\nS32\r\nRepeat steps S26 and S27 for the “Time Series” graph.\r\n\r\nS33\r\nCreate two new calculated fields which we’ll use for the title. Name: “Max Date” Formula: WINDOW_MAX(MAX([Import Date])) Name: “Min Date” Formula: WINDOW_MIN(MIN([Import Date])) Once created, drag “Max Date” and “Min Date” to the Detail shelf.\r\n\r\nS34\r\nGo back to the “Motion” worksheet. Right-click on the “Import Date” filter and click on “Apply to Worksheets” > “All Using This Data Source”. Go back to the “Time Series” worksheet. Right-click on the “Import Date” filter and click on “Show Filter”.\r\n\r\nS35\r\nChange the title to: Singapore Merchandise Import and Exports, <AGG(Min Date)> to <AGG(Max Date)>\r\n\r\nS36\r\nWe need to create one more graph. Thankfully, this one should be easy! Right-click on the “Bar (Tooltip)” graph and click “Duplicate”. Rename this worksheet “Bar (Dashboard)”. In this worksheet, click on the black down arrow for “Tooltip” in the Filters shelf and click “Remove”.\r\n\r\nS37\r\nGo back to the “Motion” worksheet. Right-click on the “Import Market” filter and click on “Apply to Worksheets” > “Selected Worksheets…”. Click on the checkboxes for “Time Series” and “Bar (Dashboard)”.\r\n\r\nS38\r\nDrag “Max Date” and “Min Date” to the Detail shelf. Change the graph’s title to: Singapore’s Total Merchandise Trade with  market(s), <AGG(Min Date)> to <AGG(Max Date)>\r\n\r\nS39\r\nWe’ve created four graphs so far: a bubble chart, two bar charts, and a time series chart. Time to bring these components together into a dashboard view. Create a dashboard and name it “Dashboard”. Set up the dashboard view by changing the size to “Automatic” and change to “Floating”.\r\n\r\nS40\r\nDrag the “Motion” chart first. Then drag the “Time Series” chart to the right of the “Motion” chart. Then drag the “Bar (Dashboard)” chart under the “Time Series” chart. The layout should look something like the image to the right.\r\n\r\nS41\r\nTo help organize all the elements of our dashboard, we’ll use vertical container objects. Drag a vertical container into the main pane. While holding the SHIFT key down, drag the “Import Date” filter, “Import Market” filter, “Import Date” page, “Total Trade Value” legend, and “Net Balance” legend. It should look something like the image to the right.\r\n\r\nS42\r\nLet’s add some sections and labels to the vertical container to organize the information better. First, drag a text object to the main pane and input “Universal Filter”. Drag another text object to the main pane and input “Bubble Graph Animation”. Drag another text object to the main pane and input “Bubble Graph Legend”. Last, drag a blank object to the main pane. While holding the SHIFT key, drag the text objects and blank object into the vertical container. The exact order and placement can be seen in the image to the right.\r\n\r\nS43\r\nNext, we’ll organize the “Time Series” chart and the “Bar (Dashboard)” chart by placing them into a vertical container. The resulting view should look like the image to the right.\r\n\r\nS44\r\nTo finish up the dashboard, let’s add an action. From the menu bar, go to “Dashboard” > “Actions…” > “Add Action” > “Highlight…”. For Source and Target Sheets, unselect the “Bar (Dashboard)”. For Target Highlighting, select “Selected Fields” and check the box for “Import Market.”\r\n\r\nS45\r\nLastly, tidy up the graphs: add currency labels to the axes (S$), format the axes labels, format the titles, resize the graphs. The final dashboard view should look something like the view on the right.\r\n\r\n5.0 Derived Insights\r\nNo.\r\nObservation\r\nImage\r\nO1\r\nFrom the “Time Series” graph, we can see that China overtook Malaysia as Singapore’s top trading partner in terms of total trade value in 2013 (S$117B vs. S$116B). Since then, trade with China has steadily increased up to S$136B in 2020 while Malaysia has decreased (S$103B). From the history line of the “Motion” graph, we further see exports with Malaysia appear to have decreased while imports have increased.\r\n\r\nO2\r\nFrom the history line of the “Motion” graph and “Time Series” graph, we can see that Singapore’s relationship with the United States started off as a net exporter. However, around 2006, Singapore became a net importer with the United States. Indeed, imports have increased while exports have not kept pace. This trend may be worth investigating further to identify which specific categories caused the change in dynamic.\r\n\r\nO3\r\nIn its early years, Singapore was a net importer. Between 1976-1990, imports and exports totaled S$550B and S$450B respectively. It wasn’t until the mid to late 2000’s that the relationship flipped and Singapore became a net exporter as a country. This was largely driven by strong exports to China, Hong Kong, and Indonesia.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T15:28:13+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "In this post, I share how I used Tableau to redesign a graphic to improve its clarity and aesthetics.",
    "author": [
      {
        "name": "Kevin Sunga",
        "url": {}
      }
    ],
    "date": "2021-05-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualization\r\n2.0 Alternative Design\r\n3.0 Proposed Visualization\r\n4.0 Step-by-Step guide\r\n5.0 Derived Insights\r\n\r\n1.0 Critique of Visualization\r\nOriginal Graphic1.1 Clarity\r\nThe title “Merchandise Trade of Top Six Trading Countries, 2019-2020” is ambiguous and doesn’t stand on its own. Without the context that the graphic is provided by the Department of Statistics, Singapore (DOS), the viewer is left wondering top six trading countries with whom? It can’t be global because the six countries in the graphic don’t represent the top six countries globally by GDP. However, even with this context, it is unclear.\r\nAnother ambiguity with the graphic’s title is it specifically calls out “Countries” but Hong Kong is not a country but a part of China.\r\nThe title is also not very descriptive. The title describes the data, but it doesn’t share the intent or main message behind the graphic.\r\nThe biggest issue with the chart is with the axes, specifically the scaling of the y-axes are different within panels and between panels. First, consider the panel for Taiwan. At first, it appears that imports and exports with Taiwan are relatively equal. However, upon closer inspection of the export y-axis (left-hand side) and the import y-axis (right-hand side), we realize that the scales are different. The import scale is double the export scale. Therefore, the insight—imports from Taiwan are double that of exports to Taiwan—is obscured.\r\nSecond, let’s attempt to compare two panels against each other: Hong Kong and Mainland China. At a glance, the export areas between Hong Kong and Mainland China appear to be relatively the same size. However, the scales are slightly different which makes it difficult to tell whether they’re equal or if Hong Kong vs. Mainland China is higher or lower.\r\nIn addition to the y-axes, the x-axes are also not all the same. Japan’s x-axis only shows 2020 whereas the other panels show 2019, 2020, and 2021. This creates ambiguity.\r\nThere are other more minor issues with the axes. The x-axes label says “Month of Period” but the x-axes values are years which creates incongruence between the label and the values. In addition, the x-axes for all the countries except Japan go up to 2021, but the title suggests the data is only between 2019-2020 which again creates ambiguity.\r\nAnother minor issue is the y-axes doesn’t label the currency (S$ or SGD) which is especially necessary given there’s no indication that the graphic is by or for Singapore thus leaving the reader guessing as to the real value of the imports and exports.\r\n1.2 Aesthetics\r\nSince exports and imports are not vastly different in terms of shape and area, the shaded areas mostly overlap with each other and the colors blending together mucks the clarity of the graphic.\r\nThe graphic both uses too much non-data ink and not enough. The 3 axes labels repeated 6 times for each panel for a total of 24 labels is too much non-data ink and doesn’t make it clearer or easier to read the graphic. The legend label “Measure Names” is not needed and unhelpful. The panel “titles” have a larger font size than the graphic title itself.\r\nOn the other hand, the graphic also suffers from not enough non-data ink. The axes values are too light compared to the axes labels which makes it easy to overlook. There are very light horizontal gridlines in each panel. They’re so light they’re almost imperceptible behind the shaded areas. The graphic lacks a useful background grid that enhances the readability of the graphic.\r\nThe panels don’t appear to be organized in any meaningful way either in increasing or decreasing order of trade size. The panels are on 2 arbitrary rows which hinders the ability to compare between panels.\r\nGiven the graphic is multi-panel, the decision to include a legend adds extra mental burden on the reader. After reading each panel, the reader has to remind themselves whether blue or orange is export or import.\r\n2.0 Alternative Design\r\nMock Redesign2.1 Clarity\r\nI edited the title to be: “Merchandise Trade of Singapore’s Top Six Trading Partners by Total Trade Value, 2019-2020.” This title is improved because it clarifies who the trade is with (Singapore), and it prevents any confusion by changing “countries” to “partners.”\r\nThe redesign also includes a subtitle that shares a possible main insight to be gleaned from the graphic: “Merchandise trade with Mainland China, Malaysia, the United States, and Indonesia dropped late 2019 to mid 2020 at the onset of the COVID-19 pandemic. Recovery varies by market.”\r\nTo remain consistent with the title “Top Six Trading Partners, 2019-2020,” Japan is replaced with Indonesia because Singapore’s trade with Indonesia (107M thousands of dollars) is larger than its trade with Japan (100M thousands of dollars).\r\nIn the redesign, I forced the y-axes to be the same across panels and x-axes to be the same across panels. This enables comparisons between markets. I also removed the second y-axes thus putting imports and exports on the same scale. This enables comparisons of imports and exports within panels.\r\nTo add further clarity, I changed the y and x axes labels to “Trade Value (S$)” and “Date” respectively.\r\nLastly, I changed the date values from YYYY to mmm yy to clarify the dates are continuous rather than discrete.\r\n2.2 Aesthetic\r\nTo prevent the confusion arising from the import and export areas overlapping with each other, I changed the chart to a line graph.\r\nWith respect to the balancing of non-data ink, I reduced the number of axes labels from 24 to 7. I reduced the relative size of the panel “titles.” I removed the row divider since there’s only one row.\r\nI darkened the axes values to the same color as the axes label. I added ticks to the x-axis. I also darkened the grid lines so they’re visible but not distracting. Furthermore, the clear presence of the gridlines creates a background that anchors the graphic.\r\nI consolidate the panels into one row instead of two. This facilitates the comparison of Trade Value (S$) across markets. In addition, I order the panels on total merchandise trade by market in descending order.\r\nI removed the need for a legend by using direct labeling instead.\r\n3.0 Proposed Visualization\r\nTo see the redesigned visual in Tableau Public, click here.\r\n4.0 Step-by-Step guide\r\n4.1 Clean the data in Microsoft Excel\r\nIn Microsoft Excel, open “outputFile.xlsx”.\r\nIn tab T1 delete rows 1-5 and 127+. In tab T2 delete rows 1-5 and 99+. The important thing is the first row in each tab should be the header. This will allow Tableau to read the data.\r\nSave the file.\r\n\r\n4.2 Import the data into Tableau\r\nFrom a file, import “outputFile.xlsx” into Tableau Desktop. To a “File” > “Microsoft Excel”.\r\nOnce imported, create a new union on Tableau by dragging “New Union” to the center.\r\nNext, drag the “Imports” and “Exports” sheets into the popup page and click “OK”.\r\n\r\n4.3 Transform and clean the data\r\nAfter importing the data into Tableau, we will need to transform the data. Specifically, we will need to unpivot the data to make it long instead of wide. To do this, select all the date columns, right-click, and click “Pivot”.\r\n\r\nYou should now have 5 columns 2 of which are named “Pivot Field Names” and “Pivot Field Values”. Let’s rename these columns to be more helpful. Rename “Pivot Field Names” to “Trade Month” by right-clicking and clicking “Rename”. Next, rename “Pivot Field Values” to “Trade Value”.\r\nLet’s also rename the “Sheet” column to “Trade Type” to help us identify whether a row is an import or an export. We can hide the “Table Name” column since it’s a repetitive field.\r\nLet’s also rename the “Variables” column to “Market”.\r\nWe need to ensure that our columns are using the correct data types. “Trade Month” should be a Date type. “Trade Value” should be a Number (decimal) type. “Market” and “Trade Type” should be string types. To change a column’s data type, simply click on the top left-hand corner of the column and select the appropriate data type.\r\n 6. The resulting data should have 4 columns as follows:\r\n\r\nWe want to create some calculated fields. First, we want to clean up the “Market” field and extract only the market name. To do this, right-click on “Market” and click on “Create” > “Calculated Field…”\r\n\r\nWe’ll use the function REGEX_EXTRACT to extract the market name. Input the following REGEX expression:\r\nTRIM(REGEXP_EXTRACT([Market],\"^(.*?)\\(\"))\r\nand click “OK”. Let’s name this new field “Market (Cleaned)”.\r\n\r\nNext, let’s convert “Trade Value” to a measure by right-clicking on it and clicking “Convert to Measure”.\r\n\r\nLastly, let’s create a new date field by right-clicking on “Trade Month” and clicking “Create” > “Custom date…”\r\n\r\nName this new field “Date” and for detail choose “Months”.\r\n\r\n4.4 Verify Top 6 Markets\r\nWith our data successfully imported, transformed, and cleaned, we can begin to work with our data.\r\nThe original graphic claims that the top six trading partners of Singapore between 2019-2020 are: Mainland China, the United States, Malaysia, Hong Kong, Taiwan and Japan. Let’s verify that this is indeed accurate.\r\nFirst, create a new worksheet, and let’s add “Market” to rows.\r\nDrag “Trade Value” to “Text” in the marks box. Right-click on “Trade Value” in the marks box and ensure that the measure being used is SUM.\r\n\r\nNext, we want to filter the data to include only data for 2019-2020. Drag “Trade Month” to the filters box. In the subsequent popups, first select “Years” and then select 2019 and 2020 from the list of years. Click “OK” to filter.\r\n\r\nRight-click on our newly created filter and click on “Apply to Worksheets” > “All Using this Data Source”. In doing this, we save ourselves from having to filter on the “Trade Month” column again later.\r\n\r\nLastly, let’s sort the column in descending order by right-clicking on the “Trade Value” column and clicking “Sort descending”.\r\nThe resulting table shows Singapore’s total trade value between 2019-2020 by “Market” in descending order (ignore the Total Merchandise rows). The top six markets are: Mainland China, Malaysia, the United States, Taiwan, Hong Kong, and Indonesia. Given the results of our analysis, we will replace Japan from the original graphic with Indonesia.\r\n\r\n4.5 Create redesigned graphic\r\nCreate a new worksheet. First, let’s filter for the top six markets: Mainland China, Malaysia, the United States, Taiwan, Hong Kong, and Indonesia. Drag “Market (Cleaned)” into the filters box and select the six markets and click “OK”. (Reminder: We don’t need to filter on “Trade Month” since we set up a global filter previously.)\r\n\r\nNext, drag “Market (Cleaned)” and “Date” to columns. Drag “Trade Value” to Rows.\r\nRight-click on “Date” in the columns and convert it to an “Attribute”.\r\n\r\nDrag “Date” into “Detail” in the marks box. The graph should look something like this so far.\r\n\r\nDrag “Trade Type” into “Color” and “Label” in the marks box.\r\n\r\nWe’re almost done! Now we just need to do some detail and polishing. Let’s remove the legend and change the color of the “Trade Type” labels to match the line. Click on the down arrow in the legend and click “Hide.” Click on “Label” and under “Font” click on “Match Mark Color”. We’ll also use “Center” horizontal alignment.\r\n\r\nNow, let’s work on the axes. Rename the y-axes to “Trade Value (S$)” to clarify the currency.\r\nRight-click on the y-axis and click “Format”. Change the title’s font to Tableau Book, font size to 10, and color to HTML #333333. Do the same for the x-axis label for consistency.\r\nTo clarify that the x-axis is a continuous variable, let’s change the scale of the x-axis and add ticks. Right-click on the x-axis and click “Format”. On the left pane, change dates to custom and input the following format “mmm yy”. For ticks, I chose the color #555555 and 25% transparency.\r\n\r\nIncrease the font size of the market names to size 12. Hide the “Market (Cleaned)” label.\r\nSort the panes by “Trade Value”. Right-click on “Market (Cleaned)” in the columns and click “Sort…”. For Sort By choose “Field”, for Sort Order choose “Descending”, for Field Name choose “Trade Value”, and for Aggregation choose “Sum”. Now the panes are in a logical order.\r\n\r\nAdd row gridlines to facilitate reading the graph. In the top bar, click on “Format” > “Lines…”. On the left pane, navigate to the rows tab. Select the solid line, the thin line, and set the color to #f2f2f2.\r\n\r\nRemove the row divider. Click on “Format” > “Borders”. On the left pane, set row divider to none.\r\nThe last step is to add our titles. Set the title to “Merchandise Trade of Singapore’s Top Six Trading Partners by Total Trade Value, 2019-2020” using font Calibri, font size 18, and color #000000. To make it easy for the reader to know what the graph is about, let’s also add a subtitle “Merchandise trade with Mainland China, Malaysia, the United States, and Indonesia dropped late 2019 to mid 2020 at the onset of the COVID-19 pandemic. Recovery varies by market” using font Calibri, font size 14, and color #333333.\r\nThe final graphic should look like the graphic below.\r\nFinal Redesign5.0 Derived Insights\r\nTrade drops significantly for Mainland China, Malaysia, the United States, and Indonesia from late 2019 to mid 2020. The drop coincides with the time when each market was hit with COVID-19—China in late 2019/early 2020 and the United States in March 2020. Unlike these noted markets, trade doesn’t visibly drop with Taiwan and Hong Kong—both regions that handled COVID-19 comparatively well. This is made clearer when we add trendlines.\r\n\r\nFor Taiwan, the import line is above the export line which tells us that Singapore is a net importer with Taiwan. Conversely, Singapore is a net exporter with Hong Kong and Indonesia. The trade balance is most unequal with Hong Kong where exports are roughly 800% more than imports.\r\nStarting in January 2020, the import line for Malaysia begins to cleanly diverge from the export line which indicates a possible shift in trading relationships between the markets. Similarly, exports overtake imports with Mainland China late 2020.\r\nIn terms of total trade value, Singapore’s top trading partners between 2019-2020 in descending order are: Mainland China, Malaysia, the United States, Taiwan, Hong Kong, and Indonesia.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T22:48:37+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Kevin's ISSS608 Visual Analytics Blog",
    "description": "Welcome to my blog, ISSS608 Visual Analytics. I hope you enjoy \nreading what I have to say!",
    "author": [
      {
        "name": "Kevin Sunga",
        "url": {}
      }
    ],
    "date": "2021-05-26",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-29T22:41:08+08:00",
    "input_file": {}
  }
]
